{
  "en": {
    "title": "Focal",
    "whats_this": "What is this?",
    "whats_this_content": "This project is a part of the Hackiethon 2025 event, which participants are tasked to create widget components using ReactJS. We are giving some examples such as weather widget, calculators. They all look really cool and I really want to match their quality of design. This is also the first time that I use react-dnd (drag and drop), which is a feature that I am looking to learn and use for really long, so i took this opportunity to design my widget based on that.",
    "brainstorm": "Brainstorm",
    "brainstorm_content_1": "Although this is not the first time that I wrote ReactJS app, this is the first time that I am writing an app that is not fullscreen, which poses some design challenges that I will need to solve, because of the limited spaces and the modularity required.",
    "brainstorm_content_2": "I started by brainstorming about widgets that I can do. I noticed that a lot of people like to listen to music when studying, so I thought it would be a good idea to combine a timer/stopwatch with a music player as a music widget, so that people can access both at the same time.",
    "design_and_code": "Design & Code",
    "design_and_code_content_1": "Initially, I started with the center of the widget with the stopwatch and countdown timer component. I design the component so that it utilise the same set of timer and buttons, with some slight modification to make it more intuitive to use. Since it is a widget, I make it expandable, so it could be in a large widget and medium widget size, depending on user preference.",
    "design_and_code_content_2": "Then I started to work on the music player part. The mp3 file droparea took me a while to figure out the implementation, but it's a fun thing to learn about.",
    "design_and_code_content_3": "The next component I've implemented is the music visualisation, because a plain music player is BORING, so I added a music visualiser on the divider line between the music player and timer to add a bit of interactivity.",
    "design_and_code_content_4": "As the submission of the hackathon is getting near, I decided to add in the last function to boost the widget useability. I've add a playlist so that it is easier to switch between a bunch of music uploads. And I also add a function to allow dropping images into the player to customise the looks.",
    "alt_widget": "widget",
    "award": "Award",
    "awaed_content_1": "After days of work, I finally finish my widget project. At the closing ceremony, I've seen quite a few amazing project, and I would like to learn more about. ",
    "awaed_content_2": "My project Focal end up winning the Best Design award of Hackiethon 2025.",
    "alt_award": "award"
  },
  "zh": {
    "title": "Focal：極簡音樂播放器",
    "whats_this": "這是什麼？",
    "whats_this_content": "這個專案是 Hackiethon 2025 活動的一部分，參賽者需使用 ReactJS 創建 widget 元件。例如天氣小工具、計算機等等，它們看起來都很酷，我希望我的設計質感能媲美它們。這也是我第一次使用 react‑dnd（拖放功能），這個功能我一直想學很久，所以我就趁這機會以它來設計我的 widget。",
    "brainstorm": "腦力激盪",
    "brainstorm_content_1": "雖然我之前也寫過 ReactJS 應用，但這是我第一次寫非全螢幕應用，由於空間有限且須具備模組化，設計上就有不少挑戰需要解決。",
    "brainstorm_content_2": "我先構思可以做哪些 widget。我發現很多人喜歡邊念書邊聽音樂，因此我覺得可以把計時器／秒錶和音樂播放器結合成一個音樂 widget，讓使用者同時使用兩者。",
    "design_and_code": "設計與程式",
    "design_and_code_content_1": "起初，我從中間部分做起，加上秒錶與倒數計時器元件。我設計它們共用同一套計時器與按鈕，並稍微調整操作邏輯，讓使用起來更直覺。為了符合 widget 特性，我也設計了可擴展尺寸，讓它能顯示為大尺寸或中尺寸，依使用者偏好切換。",
    "design_and_code_content_2": "接著我開始做音樂播放器的部分。mp3 檔案拖放區的實作花了我一些時間，但這是一個很好玩的學習過程。",
    "design_and_code_content_3": "接下來我實作了音樂視覺化元件，因為單純的音樂播放器太無聊了，所以我在音樂播放器與計時器的分隔線中加入了音樂視覺器，增添一些互動效果。",
    "design_and_code_content_4": "隨著提交期限逼近，我決定加入最後一項功能來提升 widget 的可用性。我加了播放清單功能，方便在多首音樂間切換，並新增拖放圖片到播放器的功能，以自訂外觀。",
    "alt_widget": "小工具",
    "award": "獎項",
    "awaed_content_1": "經過數天努力，我終於完成我的 widget 專案。在閉幕典禮上，我看到不少很棒的專案，也想多學習他們的做法。",
    "awaed_content_2": "我的專案 Focal 最終獲得了 Hackiethon 2025 的最佳設計獎。",
    "alt_award": "獎項"
  },
  "de": {
    "title": "Focal: Minimalistischer Musikplayer",
    "whats_this": "Was ist das?",
    "whats_this_content": "Dieses Projekt ist Teil des Hackiethon 2025-Events, bei dem die Teilnehmer ReactJS nutzen, um Widget-Komponenten zu erstellen. Beispiele sind Wetter-Widgets oder Taschenrechner. Sie sehen alle sehr cool aus und ich wollte eine vergleichbare Designqualität erreichen. Dies ist auch das erste Mal, dass ich react‑dnd (Drag & Drop) verwende – ein Feature, das ich schon lange lernen wollte – daher habe ich diese Gelegenheit genutzt, um mein Widget darauf aufzubauen.",
    "brainstorm": "Brainstorming",
    "brainstorm_content_1": "Obwohl ich bereits ReactJS-Apps geschrieben habe, ist dies das erste Mal, dass ich eine nicht vollbildige App entwickle, was aufgrund der begrenzten Fläche und erforderlichen Modularität Design‑Herausforderungen mit sich bringt.",
    "brainstorm_content_2": "Ich begann damit, über mögliche Widgets nachzudenken. Mir fiel auf, dass viele beim Lernen Musik hören. Daher dachte ich, es wäre eine gute Idee, einen Timer/Sekundenzeiger mit einem Musikplayer zu kombinieren – so hat man beides in einem Musik‑Widget.",
    "design_and_code": "Design & Code",
    "design_and_code_content_1": "Zunächst habe ich in der Mitte des Widgets mit der Stoppuhr- und Countdown‑Timer‑Komponente begonnen. Ich habe die Komponente so gestaltet, dass sie die gleiche Timer- und Tasten‑Logik nutzt, mit kleinen Anpassungen für mehr Intuitivität. Da es sich um ein Widget handelt, habe ich es erweiterbar gemacht – es kann als große oder mittlere Variante angezeigt werden, je nach Nutzer‑Vorliebe.",
    "design_and_code_content_2": "Dann arbeitete ich am Musikplayer-Teil. Die Implementierung des MP3-Datei‑Drag‑and‑Drop‑Bereichs hat etwas Zeit in Anspruch genommen, aber es hat Spaß gemacht, das zu lernen.",
    "design_and_code_content_3": "Die nächste Komponente, die ich implementiert habe, ist die Musik‑Visualisierung. Ein einfacher Musikplayer ist langweilig, also habe ich auf der Trennlinie zwischen Musikplayer und Timer eine Visualisierung hinzugefügt, um etwas Interaktivität zu erzeugen.",
    "design_and_code_content_4": "Da die Einreichungsfrist der Hackathon näher rückte, entschied ich mich, zum Schluss eine Funktion hinzuzufügen, um die Bedienbarkeit des Widgets zu verbessern. Ich habe eine Playlist eingebaut, damit das Wechseln zwischen mehreren Musik‑Uploads einfacher ist. Außerdem habe ich eine Funktion hinzugefügt, um Bilder ins Player‑Interface zu ziehen und so das Aussehen anzupassen.",
    "alt_widget": "Widget",
    "award": "Auszeichnung",
    "awaed_content_1": "Nach Tagen harter Arbeit habe ich mein Widget‑Projekt endlich fertiggestellt. Bei der Abschlusszeremonie sah ich einige erstaunliche Projekte und wollte mehr darüber lernen.",
    "awaed_content_2": "Mein Projekt Focal gewann schließlich den Preis für das beste Design beim Hackiethon 2025.",
    "alt_award": "Auszeichnung"
  },
  "ja": {
    "title": "Focal：ミニマルな音楽プレーヤー",
    "whats_this": "これは何ですか？",
    "whats_this_content": "このプロジェクトは Hackiethon 2025 の一部で、参加者は ReactJS を使ってウィジェットコンポーネントを作成するという課題に取り組みました。天気ウィジェットや電卓などの例があり、どれも本当にかっこよくて、そのデザイン品質に合わせたいと思いました。また、react‑dnd（ドラッグ＆ドロップ）を使うのも初めてで、長く学びたかった機能だったので、この機会にそれを核にしたウィジェットを設計しました。",
    "brainstorm": "ブレインストーミング",
    "brainstorm_content_1": "ReactJS アプリを書くのは初めてではありませんが、フルスクリーンではないアプリを作るのはこれが初めてで、限られたスペースとモジュール性が必要なため、いくつかのデザイン上の課題がありました。",
    "brainstorm_content_2": "まず作れるウィジェットを考え始めました。多くの人が勉強中に音楽を聴くことに気づき、それならタイマー／ストップウォッチと音楽プレーヤーを組み合わせた音楽ウィジェットがいいと思いました。そうすれば両方に同時にアクセスできます。",
    "design_and_code": "デザイン & コード",
    "design_and_code_content_1": "最初はウィジェット中央にストップウォッチとカウントダウンタイマーのコンポーネントを配置しました。同じタイマーとボタンセットを共有しつつ、操作性を向上させるためにわずかな調整を加えました。ウィジェットなので展開可能にし、大サイズと中サイズの表示に対応できるようにしました。",
    "design_and_code_content_2": "次に音楽プレーヤー部分に取り組みました。MP3 ファイルのドロップエリアの実装には少し時間がかかりましたが、学ぶのが楽しかったです。",
    "design_and_code_content_3": "次に実装したのが音楽のビジュアライゼーション機能です。普通の音楽プレーヤーではつまらないので、ミュージックプレーヤーとタイマーの間の仕切り線に視覚効果を入れて、少しインタラクティブにしました。",
    "design_and_code_content_4": "ハッカソンの提出が近づくにつれ、最後にウィジェットの使いやすさを高める機能を追加することにしました。プレイリスト機能を追加し、複数の音楽を切り替えやすくしました。また、画像をプレーヤーにドロップして見た目をカスタマイズできる機能も追加しました。",
    "alt_widget": "ウィジェット",
    "award": "賞",
    "awaed_content_1": "数日間の作業を経て、ついにウィジェットプロジェクトを完成させました。クロージングセレモニーでは素晴らしいプロジェクトをいくつか見て、もっと学びたいと思いました。",
    "awaed_content_2": "私のプロジェクト Focal は、最終的に Hackiethon 2025 のベストデザイン賞を受賞しました。",
    "alt_award": "賞"
  },
  "es": {
    "title": "Focal: Reproductor de música minimalista",
    "whats_this": "¿Qué es esto?",
    "whats_this_content": "Este proyecto es parte del evento Hackiethon 2025, donde los participantes deben crear componentes widget usando ReactJS. Se mostraron ejemplos como widgets de clima o calculadoras. Todos se ven muy geniales y yo quería igualar esa calidad de diseño. Además, era mi primera vez usando react‑dnd (arrastrar y soltar), una función que quería aprender desde hace tiempo, así que aproveché la oportunidad para diseñar mi widget con ella.",
    "brainstorm": "Lluvia de ideas",
    "brainstorm_content_1": "Aunque ya había creado aplicaciones con ReactJS, esta es la primera vez que hago una app que no es de pantalla completa, lo cual presenta desafíos de diseño por el espacio limitado y la modularidad requerida.",
    "brainstorm_content_2": "Empecé pensando en posibles widgets. Observé que a mucha gente le gusta escuchar música mientras estudia, así que pensé que sería buena idea combinar un temporizador/cronómetro con un reproductor de música en un widget musical, para que se puedan usar ambos al mismo tiempo.",
    "design_and_code": "Diseño y código",
    "design_and_code_content_1": "Inicialmente, comencé por el centro del widget con los componentes de cronómetro y temporizador. Diseñé el componente para que utilice el mismo conjunto de temporizador y botones, con ligeras modificaciones para que fuera más intuitivo. Como es un widget, lo hice expandible, para que pueda mostrarse en tamaño grande o mediano, según la preferencia del usuario.",
    "design_and_code_content_2": "Luego comencé a trabajar en la parte del reproductor de música. El área para soltar archivos mp3 me tomó un tiempo implementarla, pero fue una experiencia divertida de aprendizaje.",
    "design_and_code_content_3": "El siguiente componente que implementé fue la visualización de la música, porque un reproductor simple es ABURRIDO, así que añadí un visualizador en la línea divisoria entre el reproductor y el temporizador para aportar un poco de interactividad.",
    "design_and_code_content_4": "A medida que se acercaba la fecha de entrega, decidí agregar la última función para mejorar la usabilidad del widget. Añadí una lista de reproducción para facilitar el cambio entre varias subidas de música. También añadí la función de poder soltar imágenes en el reproductor para personalizar su apariencia.",
    "alt_widget": "widget",
    "award": "Premio",
    "awaed_content_1": "Después de días de trabajo, finalmente terminé mi proyecto de widget. En la ceremonia de clausura vi varios proyectos asombrosos y me gustaría aprender más de ellos.",
    "awaed_content_2": "Mi proyecto Focal terminó ganando el premio al Mejor Diseño del Hackiethon 2025.",
    "alt_award": "premio"
  },
  "ko": {
    "title": "Focal: 미니멀 음악 플레이어",
    "whats_this": "이게 뭐예요?",
    "whats_this_content": "이 프로젝트는 Hackiethon 2025 이벤트의 일부로, 참가자들이 ReactJS를 사용해 위젯 컴포넌트를 만드는 과제를 수행했습니다. 날씨 위젯, 계산기 등 예시가 주어졌고, 모두 정말 멋졌기에 디자인 퀄리티에 맞추고 싶었습니다. 또한, react‑dnd(드래그 앤 드롭)를 처음 사용해 보는 것이었는데, 오래 전부터 배우고 싶었던 기능이라 이 기회에 위젯을 그것을 기반으로 설계했습니다.",
    "brainstorm": "브레인스토밍",
    "brainstorm_content_1": "비록 ReactJS 앱을 써 본 적은 있지만, 전체 화면이 아닌 앱을 만든 건 이번이 처음이라 제한된 공간과 모듈성이 필요한 디자인상 많은 챌린지가 있었어요.",
    "brainstorm_content_2": "먼저 어떤 위젯을 만들 수 있을지 아이디어를 구상했어요. 공부하면서 음악 듣는 사람들을 보니 타이머/스톱워치와 음악 플레이어를 결합한 음악 위젯이 좋겠다고 생각했고, 사람들이 동시에 둘을 사용할 수 있게 하고 싶었습니다.",
    "design_and_code": "디자인 & 코드",
    "design_and_code_content_1": "처음엔 위젯 중앙에 스톱워치와 카운트다운 타이머 컴포넌트를 배치했어요. 같은 타이머와 버튼 세트를 활용하되 사용하기 직관적으로 약간 수정했습니다. 위젯이라 확장 가능하게 만들어 사용자의 선호에 따라 대형 또는 중형 크기로 사용할 수 있게 했습니다.",
    "design_and_code_content_2": "그리고 음악 플레이어 부분 작업을 시작했어요. mp3 파일 드롭 영역 구현에 시간이 좀 걸렸지만, 배우는 재미가 있었답니다.",
    "design_and_code_content_3": "다음으로 구현한 컴포넌트는 음악 시각화 기능입니다. 단순한 음악 플레이어는 지루하니까 플레이어와 타이머 사이의 구분선에 시각 효과를 넣어 인터랙티브하게 만들었습니다.",
    "design_and_code_content_4": "해커톤 제출이 다가오고 마지막으로 위젯 사용성을 높이기 위해 기능을 추가했습니다. 재생 목록을 추가해 여러 음악 업로드 사이 전환을 쉽게 만들었고, 플레이어에 이미지를 드롭해 외관을 커스터마이즈할 수 있는 기능도 넣었습니다.",
    "alt_widget": "위젯",
    "award": "수상",
    "awaed_content_1": "며칠간의 작업 끝에 드디어 위젯 프로젝트를 완성했습니다. 클로징 세리머니에서 몇몇 놀라운 프로젝트를 보고 더 배우고 싶어졌어요.",
    "awaed_content_2": "제 프로젝트 Focal은 결국 Hackiethon 2025에서 최고의 디자인 상을 수상했습니다.",
    "alt_award": "수상"
  }
}
