{
  "en": {
    "intro": "I'm",
    "subtitle_1": "Creative Developer",
    "subtitle_2": "Design Enthusiast",
    "subtitle_3": "I Develop for Fun!",
    "about_me": "About Me",
    "about_me_content": "I am currently an undergraduate student studying at the University of Melbourne, planning to major in Computer Science. It is always enjoyable to learn and explore different areas of computing.",
    "skills": "Skills",
    "skills_content": "I enjoy trying out different technologies! In my free time, I explore different fields related to computing. My skill set spans various fields, including web design, AI / ML, graphics and much more!",
    "skills_1": "Programing languages",
    "skills_2": "Artificial Intelligence",
    "skills_3": "Website Design",
    "interest_ai": "Interest: AI and ML",
    "interest_ai_content_1": "Artificial intelligence is always a really interesting topic, and I am always eager to dive deeper. Starting with OpenCV, I've did some simple line-following algorithms, which are not complex, but fun.",
    "interest_ai_content_2": "Later, I got into Machine Learning and Deep Learning field and was stunned by how much a computer can do. Starting simple, I've wrote some classic machine learning programs such as Titanic, Housing price prediction to get experience in data processing and cleaning. Later, I started to write CNN for MNIST hand-written digits recognition, learning more about neural networks. Getting more advanced, I've tried Generative adversarial network (GAN) to generate hand-written digits. After exploring those, Igot into NLP for RNN, LSTM etc. I've also tried some 2D self driving-car using JS for fun.",
    "interest_ai_content_3": "After the explosion of generative AI during 2022, I started to explore more about cutting-edge research. I've attempted to build a language model on transformer architecture and an image generation model using UNet.",
    "interest_sysadmin": "Interest: System Admin",
    "interest_sysadmin_content": "I like to explore around my systems and build applications on it. On the web design backend side, I try out many different programs, such as docker and nginx to manage the backend of a service. From a more virtualization perspective, I would often try software such as VirtualBox or Proxmox, and use different Linux distros on it. I also think that knowing how networking works is a pretty importantpart of being a computer science major, so I did learn about things such as routers, switches and most importantly, the OSImodel.",
    "interest_web_design": "Interest: Web Design",
    "interest_web_design_content_1": "I am also interested in web design since I can create a webpage of my own and design it however I want. I often look up tutorials togather inspiration to build a better website.",
    "interest_web_design_content_2": "I start with learning various programming languages for the web, such as HTML, CSS, JS and PHP without the use of any framework while hosting the backend using Python Django or Flask.",
    "interest_web_design_content_3": "Shortly after, I realised that my workflow would be much betterwith framework, I started to learn some JavaScript libraries suchas Next.js along with tailwind and different animation libraries.",
    "interest_web_design_content_4": "Most of the time, writing projects makes me improve the most. Therefore, I spend lots of my free time tweaking and rewriting this website. It is a fun thing for me.",
    "interest_graphics": "Interest: Graphics",
    "interest_graphics_content_1": "Graphics is also the field I want to explore more about. Currently, I am not experienced in this field, but I really wantto explore more about it.",
    "interest_graphics_content_2": "In the past, I've tried a lot of different things relating to graphics, such as VFX with After Effects or playing around with Unity. In terms of graphics and modelling, I've also used Blender to do a lot of stuff. For example, I use Blender for camera tracking, fluid simulation, ray tracing, modelling and animation. I would like to learn more to create more advanced visuals.",
    "interest_graphics_content_3": "Sometimes I also use my programming skills to write something fun. There is an OpenGL projection code that I wrote to do orthogonal projection. And another program that does basic ray tracing.",
    "future_vision": "Future Vision",
    "future_vision_content_1": "As artificial intelligence integrates into our lives bit by bit, it is important to understand the inner workings of those new technologies. I would like to improve myself so that in the future, I can build a technology that benefits humanity.",
    "future_vision_content_2": "Another part of computer science that interests me is cybersecurity. Thousands of cyber threats are circulating the internet. I am passionate about cybersecurity and want to learn more about it in the future, hopefully developing technology that can prevent cyber threats effectively.",
    "contact": "Contact",
    "journey_begin": "The Jorney Begins...",
    "link_1_title": "Projects",
    "link_1_description": "Explore various projects I've worked on",
    "link_2_title": "Timeline",
    "link_2_description": "Check out the timeline of my journey!",
    "link_3_title": "Blog",
    "link_3_description": "Explore some new development of the site!"
  },
  "zh": {
    "intro": "我是",
    "subtitle_1": "創意開發者",
    "subtitle_2": "設計愛好者",
    "subtitle_3": "我為樂趣而開發！",
    "about_me": "關於我",
    "about_me_content": "我目前是墨爾本大學的本科生，計劃主修電腦科學。學習和探索不同的計算領域總是讓人感到愉快。",
    "skills": "技能",
    "skills_content": "我喜歡嘗試各種不同的技術！空閒時，我會探索與計算相關的不同領域。我的技能橫跨多個領域，包括網頁設計、人工智慧／機器學習、圖形處理等等！",
    "skills_1": "程式語言",
    "skills_2": "人工智慧",
    "skills_3": "網站設計",
    "interest_ai": "興趣：人工智慧與機器學習",
    "interest_ai_content_1": "人工智慧一直是個非常有趣的主題，我總是渴望更深入地了解。從 OpenCV 開始，我實作了一些簡單的循線演算法，雖然不複雜，但很有趣。",
    "interest_ai_content_2": "之後我開始接觸機器學習與深度學習，對電腦能做到的事情感到震撼。從簡單的專案開始，我寫了一些經典的機器學習程式，例如鐵達尼號預測、房價預測，藉此學習資料處理與清洗。接著我開始寫用於手寫數字辨識的 CNN，更深入了解神經網路。進階後，我也嘗試了生成對抗網路（GAN）來產生手寫數字。這些之後，我也涉獵了 NLP，像是 RNN、LSTM 等。我還試過用 JavaScript 寫 2D 自駕車遊戲來娛樂。",
    "interest_ai_content_3": "在 2022 年生成式 AI 爆發後，我開始探索更多前沿研究。我曾試著基於 transformer 架構構建語言模型，並用 UNet 建立圖像生成模型。",
    "interest_sysadmin": "興趣：系統管理",
    "interest_sysadmin_content": "我喜歡探索自己的系統並在其上建立應用程式。在網站後端方面，我嘗試過許多不同的程式，例如使用 Docker 和 Nginx 來管理服務的後端。從虛擬化角度來看，我也常使用像是 VirtualBox 或 Proxmox 等軟體，並在上面安裝不同的 Linux 發行版。我也認為了解網路運作是電腦科學的重要部分，因此我學習了路由器、交換機，還有最重要的 OSI 模型等相關知識。",
    "interest_web_design": "興趣：網站設計",
    "interest_web_design_content_1": "我也對網站設計很有興趣，因為我可以建立自己的網頁，並依照自己想法設計。我經常查找教學影片以獲得靈感，讓網站變得更好。",
    "interest_web_design_content_2": "我從學習網頁開發的各種程式語言開始，例如 HTML、CSS、JS 和 PHP，初期沒有使用框架，後端則使用 Python 的 Django 或 Flask 來架設。",
    "interest_web_design_content_3": "不久後，我發現使用框架能讓我的開發流程更順暢，於是我開始學習一些 JavaScript 函式庫，例如 Next.js，以及 Tailwind 和各種動畫函式庫。",
    "interest_web_design_content_4": "大多數時候，寫專案是我進步最快的方式。因此，我會花很多空閒時間來調整和重寫這個網站。對我來說這是很有趣的事。",
    "interest_graphics": "興趣：圖形處理",
    "interest_graphics_content_1": "圖形處理也是我想深入探索的領域。目前我在這方面經驗不多，但我真的很想了解更多。",
    "interest_graphics_content_2": "過去我嘗試過很多與圖形相關的東西，例如使用 After Effects 做視覺特效，或是在 Unity 裡試玩各種功能。在圖形和建模方面，我也用 Blender 做了很多事。例如，我用 Blender 進行攝影機追蹤、流體模擬、光線追蹤、建模和動畫。我希望能學到更多，創造出更進階的視覺作品。",
    "interest_graphics_content_3": "有時我也會用程式技巧寫一些有趣的東西。我寫過一段 OpenGL 投影程式碼，用來實現正交投影；也寫過另一個簡單的光線追蹤程式。",
    "future_vision": "未來願景",
    "future_vision_content_1": "隨著人工智慧逐步融入我們的生活，了解這些新技術的運作原理變得越來越重要。我希望提升自己的能力，將來能打造對人類有益的技術。",
    "future_vision_content_2": "電腦科學中我感興趣的另一個領域是資安。網路上有成千上萬的資安威脅。我對資安充滿熱情，未來希望能學到更多，開發出有效防禦網路威脅的技術。",
    "contact": "聯絡方式",
    "journey_begin": "啟程!!",
    "link_1_title": "專案",
    "link_1_description": "探索我參與過的各種專案",
    "link_2_title": "時間軸",
    "link_2_description": "查看我的成長旅程時間線！",
    "link_3_title": "部落格",
    "link_3_description": "探索最新動態！"
  },
  "de": {
    "intro": "Ich bin",
    "subtitle_1": "Kreativer Entwickler",
    "subtitle_2": "Design-Enthusiast",
    "subtitle_3": "Ich entwickle zum Spaß!",
    "about_me": "Über mich",
    "about_me_content": "Ich bin derzeit ein Bachelor-Student an der Universität Melbourne und plane, Informatik zu studieren. Es macht mir immer Spaß, verschiedene Bereiche der Informatik zu erkunden und zu lernen.",
    "skills": "Fähigkeiten",
    "skills_content": "Ich probiere gerne verschiedene Technologien aus! In meiner Freizeit erkunde ich verschiedene Bereiche der Informatik. Mein Skillset umfasst viele Bereiche, darunter Webdesign, KI / ML, Grafik und vieles mehr!",
    "skills_1": "Programmiersprachen",
    "skills_2": "Künstliche Intelligenz",
    "skills_3": "Webdesign",
    "interest_ai": "Interesse: KI und ML",
    "interest_ai_content_1": "Künstliche Intelligenz ist immer ein sehr spannendes Thema, und ich freue mich immer darauf, tiefer einzutauchen. Angefangen mit OpenCV habe ich einige einfache Linienverfolgungsalgorithmen implementiert – nicht komplex, aber unterhaltsam.",
    "interest_ai_content_2": "Später habe ich mich mit dem Bereich Maschinelles Lernen und Deep Learning beschäftigt und war erstaunt, was Computer alles leisten können. Ich begann mit klassischen ML-Projekten wie Titanic oder Hauspreisvorhersage, um Erfahrung mit Datenverarbeitung und -bereinigung zu sammeln. Danach schrieb ich ein CNN zur Erkennung handgeschriebener Ziffern (MNIST) und lernte mehr über neuronale Netzwerke. Fortgeschrittener habe ich mich an generative gegnerische Netzwerke (GANs) gewagt, um handgeschriebene Zahlen zu erzeugen. Nach diesen Erfahrungen begann ich mit NLP, insbesondere mit RNNs und LSTMs. Zum Spaß habe ich auch ein 2D-Selbstfahr-Auto in JavaScript programmiert.",
    "interest_ai_content_3": "Nach dem Boom von generativer KI im Jahr 2022 begann ich, mich stärker mit aktuellen Forschungsthemen zu befassen. Ich habe versucht, ein Sprachmodell auf Basis der Transformer-Architektur zu entwickeln und ein Bildgenerierungsmodell mit UNet zu erstellen.",
    "interest_sysadmin": "Interesse: Systemadministration",
    "interest_sysadmin_content": "Ich erkunde gerne meine Systeme und entwickle Anwendungen dafür. Im Backend-Bereich des Webdesigns probiere ich viele verschiedene Tools aus, wie z. B. Docker und Nginx, um den Dienst zu verwalten. Im Bereich Virtualisierung verwende ich oft Software wie VirtualBox oder Proxmox und teste verschiedene Linux-Distributionen. Ich denke auch, dass ein grundlegendes Verständnis von Netzwerktechnik für ein Informatikstudium wichtig ist, deshalb habe ich mich mit Routern, Switches und vor allem dem OSI-Modell beschäftigt.",
    "interest_web_design": "Interesse: Webdesign",
    "interest_web_design_content_1": "Ich interessiere mich auch für Webdesign, da ich damit meine eigene Webseite nach meinen Vorstellungen gestalten kann. Ich schaue mir oft Tutorials an, um Inspirationen für ein besseres Design zu sammeln.",
    "interest_web_design_content_2": "Ich begann mit verschiedenen Programmiersprachen für das Web, wie HTML, CSS, JS und PHP – ohne Frameworks – und verwendete für das Backend Python mit Django oder Flask.",
    "interest_web_design_content_3": "Kurz darauf wurde mir klar, dass meine Arbeitsweise mit Frameworks deutlich effizienter ist. Ich begann, JavaScript-Bibliotheken wie Next.js zu lernen, sowie Tailwind und verschiedene Animationsbibliotheken.",
    "interest_web_design_content_4": "Meistens lerne ich am meisten durch das Schreiben von Projekten. Deshalb verbringe ich viel Freizeit damit, diese Website zu optimieren und neu zu gestalten – es macht mir einfach Spaß.",
    "interest_graphics": "Interesse: Grafik",
    "interest_graphics_content_1": "Grafik ist ebenfalls ein Bereich, den ich weiter erforschen möchte. Zurzeit habe ich noch wenig Erfahrung, aber ich möchte unbedingt mehr darüber lernen.",
    "interest_graphics_content_2": "In der Vergangenheit habe ich bereits viele Dinge ausprobiert, die mit Grafik zu tun haben, z. B. VFX mit After Effects oder mit Unity herumgespielt. Im Bereich 3D-Grafik und Modellierung habe ich auch mit Blender gearbeitet. Zum Beispiel nutze ich Blender für Kameratracking, Flüssigkeitssimulation, Raytracing, Modellierung und Animation. Ich möchte noch mehr lernen, um fortschrittlichere visuelle Inhalte zu erstellen.",
    "interest_graphics_content_3": "Manchmal kombiniere ich auch meine Programmierkenntnisse mit Grafik. Ich habe z. B. ein OpenGL-Projekt geschrieben, das orthogonale Projektionen durchführt, sowie ein anderes zur einfachen Raytracing-Darstellung.",
    "future_vision": "Zukunftsvision",
    "future_vision_content_1": "Da künstliche Intelligenz nach und nach in unser Leben integriert wird, ist es wichtig, deren Funktionsweise zu verstehen. Ich möchte mich weiterentwickeln, um in Zukunft Technologien zu schaffen, die der Menschheit nutzen.",
    "future_vision_content_2": "Ein weiterer Bereich der Informatik, der mich interessiert, ist die Cybersicherheit. Tausende Cyberbedrohungen kursieren im Internet. Ich bin leidenschaftlich an Cybersicherheit interessiert und möchte künftig mehr darüber lernen – in der Hoffnung, Technologien zu entwickeln, die Cyberangriffe effektiv verhindern können.",
    "contact": "Kontakt",
    "journey_begin": "Die Reise beginnt...",
    "link_1_title": "Projekte",
    "link_1_description": "Erkunde verschiedene Projekte, an denen ich gearbeitet habe",
    "link_2_title": "Zeitstrahl",
    "link_2_description": "Sieh dir den Zeitverlauf meiner Reise an!",
    "link_3_title": "Blog",
    "link_3_description": "Entdecke neue Entwicklungen!"
  },
  "ja": {
    "intro": "私は",
    "subtitle_1": "クリエイティブ開発者",
    "subtitle_2": "デザイン愛好者",
    "subtitle_3": "楽しみながら開発します！",
    "about_me": "私について",
    "about_me_content": "現在メルボルン大学の学部生で、コンピュータサイエンスを専攻する予定です。様々なコンピューティング分野を学び、探求することはいつも楽しいです。",
    "skills": "スキル",
    "skills_content": "様々な技術に挑戦するのが好きです！暇なときには、コンピューティングに関連するさまざまな分野を探検しています。私のスキルセットはウェブデザイン、AI/ML、グラフィックスなど多岐にわたります！",
    "skills_1": "プログラミング言語",
    "skills_2": "人工知能",
    "skills_3": "ウェブサイトデザイン",
    "interest_ai": "関心: AIとML",
    "interest_ai_content_1": "人工知能は常に非常に興味深いテーマであり、私はいつももっと深く掘り下げたがっています。OpenCVから始めて、簡単なライントレースアルゴリズムを作成したことがあります。複雑ではありませんが、楽しかったです。",
    "interest_ai_content_2": "その後、機械学習とディープラーニングの分野に入り、コンピュータがどれほど多くのことをできるかに驚きました。まずはタイタニックや住宅価格予測などの古典的な機械学習プログラムを書いて、データ処理とクレンジングの経験を積みました。その後、MNIST手書き数字認識のためにCNNを実装し、ニューラルネットワークについてさらに学びました。さらに進んで、手書き数字を生成するGANにも挑戦しました。その後、RNN、LSTMなどのNLPにも手を出しました。JSで2Dの自動運転車も遊びで作ってみました。",
    "interest_ai_content_3": "2022年の生成AIブーム以降、最先端の研究をさらに探索し始めました。トランスフォーマーアーキテクチャに基づく言語モデルや、UNetを使用した画像生成モデルの構築に挑戦しました。",
    "interest_sysadmin": "関心: システム管理",
    "interest_sysadmin_content": "自分のシステムを探索し、その上にアプリケーションを構築するのが好きです。ウェブデザインのバックエンド側では、dockerやnginxなどのさまざまなプログラムを試してサービスのバックエンドを管理しています。仮想化の観点からは、VirtualBoxやProxmoxをよく試し、さまざまなLinuxディストリを使用しています。また、ネットワークの仕組みを知ることはコンピュータサイエンス専攻者にとって重要だと考えており、ルーター、スイッチ、そして何よりOSIモデルについて学びました。",
    "interest_web_design": "関心: ウェブデザイン",
    "interest_web_design_content_1": "自分でウェブページを作成し、好きなようにデザインできるので、ウェブデザインにも興味があります。よくチュートリアルを見てインスピレーションを得ています。",
    "interest_web_design_content_2": "HTML、CSS、JS、PHPなどのさまざまなウェブプログラミング言語をフレームワークなしで学びながら、PythonのDjangoやFlaskを使ってバックエンドをホスティングし始めました。",
    "interest_web_design_content_3": "その後、ワークフローはフレームワークの方がはるかに良いと気づき、Next.jsなどのJavaScriptライブラリやtailwind、さまざまなアニメーションライブラリを学び始めました。",
    "interest_web_design_content_4": "多くの場合、プロジェクトを書くことで最も成長します。そのため、多くの自由時間をこのウェブサイトの調整や書き直しに費やしています。私にとっては楽しいことです。",
    "interest_graphics": "関心: グラフィックス",
    "interest_graphics_content_1": "グラフィックスももっと探求したい分野です。現在は経験が少ないですが、本当にもっと学びたいです。",
    "interest_graphics_content_2": "過去には After Effects を使った VFX や Unity を触ったりして、グラフィックスに関連するさまざまなことに挑戦しました。グラフィックスやモデリングに関しては、Blender を多く使ってきました。たとえば、Blender を使ってカメラトラッキング、流体シミュレーション、レイトレーシング、モデリング、アニメーションなどを行いました。より高度なビジュアルを作るために、もっと学びたいです。",
    "interest_graphics_content_3": "時にはプログラミングスキルを使って楽しいものも書きます。直交投影を行う OpenGL プロジェクションコードを書いたり、基本的なレイトレーシングプログラムも作成しました。",
    "future_vision": "未来ビジョン",
    "future_vision_content_1": "人工知能が少しずつ私たちの生活に統合されていく中で、これらの新しい技術の内部動作を理解することが重要です。私は将来的に人類に役立つ技術を構築できるよう、自分自身を向上させたいです。",
    "future_vision_content_2": "コンピュータサイエンスで興味があるもう一つの分野はサイバーセキュリティです。インターネットには数千ものサイバー脅威が出回っています。私はサイバーセキュリティに情熱を持っており、将来的にはそれらの脅威を効果的に防ぐ技術を開発したいと考えています。",
    "contact": "連絡先",
    "journey_begin": "旅が始まります…",
    "link_1_title": "プロジェクト",
    "link_1_description": "私が取り組んださまざまなプロジェクトを探検",
    "link_2_title": "タイムライン",
    "link_2_description": "私の旅のタイムラインをチェック！",
    "link_3_title": "ブログ",
    "link_3_description": "新しい展開を探検しましょう！"
  },
  "es": {
    "intro": "Soy",
    "subtitle_1": "Desarrollador Creativo",
    "subtitle_2": "Entusiasta del Diseño",
    "subtitle_3": "¡Desarrollo por Diversión!",
    "about_me": "Sobre Mí",
    "about_me_content": "Actualmente soy estudiante de pregrado en la Universidad de Melbourne, planeando especializarme en Ciencias de la Computación. Siempre es gratificante aprender y explorar distintas áreas de la informática.",
    "skills": "Habilidades",
    "skills_content": "¡Disfruto probar diferentes tecnologías! En mi tiempo libre, exploro diversos campos relacionados con la informática. Mi conjunto de habilidades abarca varias áreas, incluyendo diseño web, IA/ML, gráficos y mucho más.",
    "skills_1": "Lenguajes de programación",
    "skills_2": "Inteligencia Artificial",
    "skills_3": "Diseño de sitios web",
    "interest_ai": "Interés: IA y ML",
    "interest_ai_content_1": "La inteligencia artificial siempre es un tema realmente interesante, y siempre tengo ganas de profundizar. Comenzando con OpenCV, hice algunos algoritmos simples de seguimiento de líneas, que no son complejos, pero sí divertidos.",
    "interest_ai_content_2": "Luego, me adentré en el campo del Aprendizaje Automático y el Aprendizaje Profundo y me sorprendió lo que una computadora puede hacer. Empezando de forma sencilla, escribí algunos programas clásicos de ML como Titanic y predicción de precios de viviendas para adquirir experiencia en procesamiento y limpieza de datos. Más tarde, comencé a escribir CNN para el reconocimiento de dígitos escritos a mano (MNIST), aprendiendo más sobre redes neuronales. Avanzando, probé una Red Generativa Antagónica (GAN) para generar dígitos manuscritos. Después de explorar eso, me adentré en PLN con RNN, LSTM, etc. También probé un coche autónomo 2D usando JS por diversión.",
    "interest_ai_content_3": "Tras la explosión de la IA generativa durante 2022, comencé a explorar más sobre investigación de vanguardia. Intenté construir un modelo de lenguaje basado en arquitectura transformadora y un modelo de generación de imágenes usando UNet.",
    "interest_sysadmin": "Interés: Administración de Sistemas",
    "interest_sysadmin_content": "Me gusta explorar mis sistemas y construir aplicaciones sobre ellos. En el lado del backend del diseño web, pruebo muchos programas diferentes, como docker y nginx para gestionar el backend de un servicio. Desde una perspectiva de virtualización, a menudo uso software como VirtualBox o Proxmox, y utilizo diferentes distribuciones de Linux en ellos. También creo que saber cómo funciona la red es una parte bastante importante de estudiar ciencias de la computación, así que aprendí sobre routers, switches y, lo más importante, el modelo OSI.",
    "interest_web_design": "Interés: Diseño Web",
    "interest_web_design_content_1": "También me interesa el diseño web porque puedo crear una página web propia y diseñarla como quiera. A menudo busco tutoriales para inspirarme y construir un mejor sitio web.",
    "interest_web_design_content_2": "Comencé aprendiendo varios lenguajes de programación para la web, como HTML, CSS, JS y PHP sin usar ningún framework, mientras alojaba el backend con Python Django o Flask.",
    "interest_web_design_content_3": "Poco después, me di cuenta de que mi flujo de trabajo sería mucho mejor con un framework, así que empecé a aprender algunas bibliotecas de JavaScript como Next.js junto con tailwind y diferentes bibliotecas de animación.",
    "interest_web_design_content_4": "La mayoría de las veces, escribir proyectos me hace mejorar más. Por lo tanto, paso mucho tiempo libre ajustando y reescribiendo este sitio web. Es algo divertido para mí.",
    "interest_graphics": "Interés: Gráficos",
    "interest_graphics_content_1": "Los gráficos también son el campo que quiero explorar más. Actualmente no tengo experiencia en este ámbito, pero realmente quiero aprender más.",
    "interest_graphics_content_2": "En el pasado, probé muchas cosas diferentes relacionadas con gráficos, como VFX con After Effects o experimentando con Unity. En términos de gráficos y modelado, también usé Blender para hacer muchas cosas. Por ejemplo, usé Blender para seguimiento de cámara, simulación de fluidos, ray tracing, modelado y animación. Me gustaría aprender más para crear visuales más avanzados.",
    "interest_graphics_content_3": "A veces también utilizo mis habilidades de programación para escribir algo divertido. Hay un código de proyección OpenGL que escribí para hacer proyección ortogonal. Y otro programa que hace trazado de rayos básico.",
    "future_vision": "Visión de Futuro",
    "future_vision_content_1": "A medida que la inteligencia artificial se integra en nuestras vidas poco a poco, es importante entender el funcionamiento interno de esas nuevas tecnologías. Me gustaría mejorar para que en el futuro pueda construir una tecnología que beneficie a la humanidad.",
    "future_vision_content_2": "Otra parte de la informática que me interesa es la ciberseguridad. Miles de amenazas cibernéticas circulan por Internet. Me apasiona la ciberseguridad y quiero aprender más en el futuro, con la esperanza de desarrollar tecnología que pueda prevenir amenazas cibernéticas de manera efectiva.",
    "contact": "Contacto",
    "journey_begin": "El viaje comienza...",
    "link_1_title": "Proyectos",
    "link_1_description": "Explora varios proyectos en los que he trabajado",
    "link_2_title": "Cronología",
    "link_2_description": "¡Consulta la cronología de mi viaje!",
    "link_3_title": "Blog",
    "link_3_description": "¡Explora nuevos desarrollos!"
  },
  "ko": {
    "intro": "저는",
    "subtitle_1": "창의적인 개발자",
    "subtitle_2": "디자인 열정가",
    "subtitle_3": "재미로 개발합니다!",
    "about_me": "저에 대해",
    "about_me_content": "저는 현재 멜버른 대학교에서 학부생으로 컴퓨터 과학을 전공할 계획입니다. 다양한 컴퓨팅 분야를 배우고 탐색하는 것은 항상 즐거운 일입니다.",
    "skills": "기술",
    "skills_content": "다양한 기술을 시도하는 것을 즐깁니다! 여가 시간에는 컴퓨팅 관련 여러 분야를 탐험합니다. 제 스킬셋은 웹 디자인, AI/ML, 그래픽 등 여러 분야에 걸쳐 있습니다!",
    "skills_1": "프로그래밍 언어",
    "skills_2": "인공지능",
    "skills_3": "웹사이트 디자인",
    "interest_ai": "관심사: 인공지능 및 머신러닝",
    "interest_ai_content_1": "인공지능은 항상 정말 흥미로운 주제이며, 저는 더 깊이 파고드는 것을 언제나 기대합니다. OpenCV부터 시작해 간단한 선 따르기 알고리즘을 작성해 보았는데, 복잡하진 않았지만 재미있었어요.",
    "interest_ai_content_2": "이후 머신러닝과 딥러닝 분야에 발을 들였고, 컴퓨터가 얼마나 많은 일을 할 수 있는지에 놀랐습니다. 간단하게 시작해, 타이타닉이나 주택 가격 예측 같은 고전적인 머신러닝 프로그램을 작성하며 데이터 처리와 정제 경험을 쌓았습니다. 이어서 MNIST 필기 숫자 인식을 위한 CNN을 작성하며 신경망에 대해 더 배웠습니다. 더 발전해서 GAN을 시도해 필기 숫자를 생성해 보았고, 그 후 RNN, LSTM 등 NLP 분야까지 탐구했습니다. 재밌어서 JS로 2D 자율주행차도 만들어봤어요.",
    "interest_ai_content_3": "2022년 생성형 AI 폭발 이후, 최첨단 연구를 더 탐구하기 시작했습니다. 트랜스포머 아키텍처 기반 언어 모델과 UNet을 이용한 이미지 생성 모델을 구축해 보았습니다.",
    "interest_sysadmin": "관심사: 시스템 관리자",
    "interest_sysadmin_content": "저는 시스템 주변을 탐색하고 그 위에 애플리케이션을 구축하는 것을 좋아합니다. 웹 디자인 백엔드 측면에서 docker와 nginx 같은 여러 프로그램을 사용해 백엔드 서비스를 관리해 보았습니다. 가상화 측면에서는 VirtualBox나 Proxmox를 자주 시도하며 다양한 리눅스 배포판을 사용합니다. 또한 네트워킹이 어떻게 작동하는지 아는 것은 컴퓨터 과학 전공자로서 중요하다고 생각해 라우터, 스위치, 특히 OSI 모델에 대해 배웠습니다.",
    "interest_web_design": "관심사: 웹 디자인",
    "interest_web_design_content_1": "내가 원하는 방식으로 웹페이지를 만들고 디자인할 수 있어 웹 디자인에도 관심이 많습니다. 영감을 얻기 위해 종종 튜토리얼을 찾아봅니다.",
    "interest_web_design_content_2": "HTML, CSS, JS, PHP 같은 다양한 웹 프로그래밍 언어를 프레임워크 없이 배우며 Python Django나 Flask로 백엔드를 호스팅하기 시작했습니다.",
    "interest_web_design_content_3": "곧 워크플로우가 프레임워크로 훨씬 좋아진다는 걸 깨닫고 Next.js 같은 JavaScript 라이브러리와 tailwind, 다양한 애니메이션 라이브러리를 배우기 시작했습니다.",
    "interest_web_design_content_4": "대부분의 경우 프로젝트를 작성하면서 가장 크게 발전합니다. 그래서 많은 여가 시간을 이 웹사이트를 다듬고 재작성하는 데 보냅니다. 저에게는 재미있는 일입니다.",
    "interest_graphics": "관심사: 그래픽",
    "interest_graphics_content_1": "그래픽 또한 더 탐구하고 싶은 분야입니다. 현재는 경험이 많지 않지만 정말 더 배우고 싶습니다.",
    "interest_graphics_content_2": "과거에 After Effects로 VFX를 하거나 Unity를 가지고 놀면서 그래픽 관련 다양한 것을 시도했습니다. 그래픽·모델링 측면에서는 Blender를 많이 사용했습니다. 예를 들어 Blender를 이용해 카메라 트래킹, 유체 시뮬레이션, 레이 트레이싱, 모델링, 애니메이션을 했습니다. 더 발전된 비주얼을 만들기 위해 더 배우고 싶습니다.",
    "interest_graphics_content_3": "가끔 프로그래밍 실력으로 재미있는 것을 작성하기도 합니다. 직교 투영을 위한 OpenGL 프로젝션 코드를 썼고, 기본적인 레이 트레이싱 프로그램도 작성했습니다.",
    "future_vision": "미래 비전",
    "future_vision_content_1": "인공지능이 우리 삶에 조금씩 통합됨에 따라, 이러한 새로운 기술의 내부 작동 방식을 이해하는 것이 중요합니다. 저는 미래에 인류에 이익이 되는 기술을 구축할 수 있도록 제 자신을 발전시키고 싶습니다.",
    "future_vision_content_2": "컴퓨터 과학에서 또 다른 관심 분야는 사이버보안입니다. 수천 개의 사이버 위협이 인터넷에 떠돌고 있습니다. 저는 사이버보안에 열정을 가지고 있으며, 앞으로 이를 효과적으로 방지할 수 있는 기술을 개발하고 싶습니다.",
    "contact": "연락처",
    "journey_begin": "여정이 시작됩니다...",
    "link_1_title": "프로젝트",
    "link_1_description": "제가 작업한 다양한 프로젝트 탐색",
    "link_2_title": "타임라인",
    "link_2_description": "제 여정의 타임라인을 확인해 보세요!",
    "link_3_title": "블로그",
    "link_3_description": "새로운 발전을 탐험해 보세요!"
  }
}