{
  "intro": "Ich bin",
  "subtitle_1": "Kreativer Entwickler",
  "subtitle_2": "Design-Enthusiast",
  "subtitle_3": "Ich entwickle zum Spaß!",
  "about_me": "Über mich",
  "about_me_content": "Ich bin derzeit ein Bachelor-Student an der Universität Melbourne und plane, Informatik zu studieren. Es macht mir immer Spaß, verschiedene Bereiche der Informatik zu erkunden und zu lernen.",
  "skills": "Fähigkeiten",
  "skills_content": "Ich probiere gerne verschiedene Technologien aus! In meiner Freizeit erkunde ich verschiedene Bereiche der Informatik. Mein Skillset umfasst viele Bereiche, darunter Webdesign, KI / ML, Grafik und vieles mehr!",
  "skills_1": "Programmiersprachen",
  "skills_2": "Künstliche Intelligenz",
  "skills_3": "Webdesign",
  "interest_ai": "Interesse: KI und ML",
  "interest_ai_content_1": "Künstliche Intelligenz ist immer ein sehr spannendes Thema, und ich freue mich immer darauf, tiefer einzutauchen. Angefangen mit OpenCV habe ich einige einfache Linienverfolgungsalgorithmen implementiert – nicht komplex, aber unterhaltsam.",
  "interest_ai_content_2": "Später habe ich mich mit dem Bereich Maschinelles Lernen und Deep Learning beschäftigt und war erstaunt, was Computer alles leisten können. Ich begann mit klassischen ML-Projekten wie Titanic oder Hauspreisvorhersage, um Erfahrung mit Datenverarbeitung und -bereinigung zu sammeln. Danach schrieb ich ein CNN zur Erkennung handgeschriebener Ziffern (MNIST) und lernte mehr über neuronale Netzwerke. Fortgeschrittener habe ich mich an generative gegnerische Netzwerke (GANs) gewagt, um handgeschriebene Zahlen zu erzeugen. Nach diesen Erfahrungen begann ich mit NLP, insbesondere mit RNNs und LSTMs. Zum Spaß habe ich auch ein 2D-Selbstfahr-Auto in JavaScript programmiert.",
  "interest_ai_content_3": "Nach dem Boom von generativer KI im Jahr 2022 begann ich, mich stärker mit aktuellen Forschungsthemen zu befassen. Ich habe versucht, ein Sprachmodell auf Basis der Transformer-Architektur zu entwickeln und ein Bildgenerierungsmodell mit UNet zu erstellen.",
  "interest_sysadmin": "Interesse: Systemadministration",
  "interest_sysadmin_content": "Ich erkunde gerne meine Systeme und entwickle Anwendungen dafür. Im Backend-Bereich des Webdesigns probiere ich viele verschiedene Tools aus, wie z. B. Docker und Nginx, um den Dienst zu verwalten. Im Bereich Virtualisierung verwende ich oft Software wie VirtualBox oder Proxmox und teste verschiedene Linux-Distributionen. Ich denke auch, dass ein grundlegendes Verständnis von Netzwerktechnik für ein Informatikstudium wichtig ist, deshalb habe ich mich mit Routern, Switches und vor allem dem OSI-Modell beschäftigt.",
  "interest_web_design": "Interesse: Webdesign",
  "interest_web_design_content_1": "Ich interessiere mich auch für Webdesign, da ich damit meine eigene Webseite nach meinen Vorstellungen gestalten kann. Ich schaue mir oft Tutorials an, um Inspirationen für ein besseres Design zu sammeln.",
  "interest_web_design_content_2": "Ich begann mit verschiedenen Programmiersprachen für das Web, wie HTML, CSS, JS und PHP – ohne Frameworks – und verwendete für das Backend Python mit Django oder Flask.",
  "interest_web_design_content_3": "Kurz darauf wurde mir klar, dass meine Arbeitsweise mit Frameworks deutlich effizienter ist. Ich begann, JavaScript-Bibliotheken wie Next.js zu lernen, sowie Tailwind und verschiedene Animationsbibliotheken.",
  "interest_web_design_content_4": "Meistens lerne ich am meisten durch das Schreiben von Projekten. Deshalb verbringe ich viel Freizeit damit, diese Website zu optimieren und neu zu gestalten – es macht mir einfach Spaß.",
  "interest_graphics": "Interesse: Grafik",
  "interest_graphics_content_1": "Grafik ist ebenfalls ein Bereich, den ich weiter erforschen möchte. Zurzeit habe ich noch wenig Erfahrung, aber ich möchte unbedingt mehr darüber lernen.",
  "interest_graphics_content_2": "In der Vergangenheit habe ich bereits viele Dinge ausprobiert, die mit Grafik zu tun haben, z. B. VFX mit After Effects oder mit Unity herumgespielt. Im Bereich 3D-Grafik und Modellierung habe ich auch mit Blender gearbeitet. Zum Beispiel nutze ich Blender für Kameratracking, Flüssigkeitssimulation, Raytracing, Modellierung und Animation. Ich möchte noch mehr lernen, um fortschrittlichere visuelle Inhalte zu erstellen.",
  "interest_graphics_content_3": "Manchmal kombiniere ich auch meine Programmierkenntnisse mit Grafik. Ich habe z. B. ein OpenGL-Projekt geschrieben, das orthogonale Projektionen durchführt, sowie ein anderes zur einfachen Raytracing-Darstellung.",
  "future_vision": "Zukunftsvision",
  "future_vision_content_1": "Da künstliche Intelligenz nach und nach in unser Leben integriert wird, ist es wichtig, deren Funktionsweise zu verstehen. Ich möchte mich weiterentwickeln, um in Zukunft Technologien zu schaffen, die der Menschheit nutzen.",
  "future_vision_content_2": "Ein weiterer Bereich der Informatik, der mich interessiert, ist die Cybersicherheit. Tausende Cyberbedrohungen kursieren im Internet. Ich bin leidenschaftlich an Cybersicherheit interessiert und möchte künftig mehr darüber lernen – in der Hoffnung, Technologien zu entwickeln, die Cyberangriffe effektiv verhindern können.",
  "contact": "Kontakt",
  "journey_begin": "Die Reise beginnt...",
  "link_1_title": "Projekte",
  "link_1_description": "Erkunde verschiedene Projekte, an denen ich gearbeitet habe",
  "link_2_title": "Zeitstrahl",
  "link_2_description": "Sieh dir den Zeitverlauf meiner Reise an!"
}
