
{
  "intro": "I'm",
  "subtitle_1": "Creative Developer",
  "subtitle_2": "Design Enthusiast",
  "subtitle_3": "I Develop for Fun!",
  "about_me": "About Me",
  "about_me_content": "I am currently an undergraduate student studying at the University of Melbourne, planning to major in Computer Science. It is always enjoyable to learn and explore different areas of computing.",
  "skills": "Skills",
  "skills_content": "I enjoy trying out different technologies! In my free time, I explore different fields related to computing. My skill set spans various fields, including web design, AI / ML, graphics and much more!",
  "skills_1": "Programing languages",
  "skills_2": "Artificial Intelligence",
  "skills_3": "Website Design",
  "interest_ai": "Interest: AI and ML",
  "interest_ai_content_1": "Artificial intelligence is always a really interesting topic, and I am always eager to dive deeper. Starting with OpenCV, I've did some simple line-following algorithms, which are not complex, but fun.",
  "interest_ai_content_2": "Later, I got into Machine Learning and Deep Learning field and was stunned by how much a computer can do. Starting simple, I've wrote some classic machine learning programs such as Titanic, Housing price prediction to get experience in data processing and cleaning. Later, I started to write CNN for MNIST hand-written digits recognition, learning more about neural networks. Getting more advanced, I've tried Generative adversarial network (GAN) to generate hand-written digits. After exploring those, Igot into NLP for RNN, LSTM etc. I've also tried some 2D self driving-car using JS for fun.",
  "interest_ai_content_3": "After the explosion of generative AI during 2022, I started to explore more about cutting-edge research. I've attempted to build a language model on transformer architecture and an image generation model using UNet.",
  "interest_sysadmin": "Interest: System Admin",
  "interest_sysadmin_content": "I like to explore around my systems and build applications on it. On the web design backend side, I try out many different programs, such as docker and nginx to manage the backend of a service. From a more virtualization perspective, I would often try software such as VirtualBox or Proxmox, and use different Linux distros on it. I also think that knowing how networking works is a pretty importantpart of being a computer science major, so I did learn about things such as routers, switches and most importantly, the OSImodel.",
  "interest_web_design": "Interest: Web Design",
  "interest_web_design_content_1": "I am also interested in web design since I can create a webpage of my own and design it however I want. I often look up tutorials togather inspiration to build a better website.",
  "interest_web_design_content_2": "I start with learning various programming languages for the web, such as HTML, CSS, JS and PHP without the use of any framework while hosting the backend using Python Django or Flask.",
  "interest_web_design_content_3": "Shortly after, I realised that my workflow would be much betterwith framework, I started to learn some JavaScript libraries suchas Next.js along with tailwind and different animation libraries.",
  "interest_web_design_content_4": "Most of the time, writing projects makes me improve the most. Therefore, I spend lots of my free time tweaking and rewriting this website. It is a fun thing for me.",
  "interest_graphics": "Interest: Graphics",
  "interest_graphics_content_1": "Graphics is also the field I want to explore more about. Currently, I am not experienced in this field, but I really wantto explore more about it.",
  "interest_graphics_content_2": "In the past, I've tried a lot of different things relating to graphics, such as VFX with After Effects or playing around with Unity. In terms of graphics and modelling, I've also used Blender to do a lot of stuff. For example, I use Blender for camera tracking, fluid simulation, ray tracing, modelling and animation. I would like to learn more to create more advanced visuals.",
  "interest_graphics_content_3": "Sometimes I also use my programming skills to write something fun. There is an OpenGL projection code that I wrote to do orthogonal projection. And another program that does basic ray tracing.",
  "future_vision": "Future Vision",
  "future_vision_content_1": "As artificial intelligence integrates into our lives bit by bit, it is important to understand the inner workings of those new technologies. I would like to improve myself so that in the future, I can build a technology that benefits humanity.",
  "future_vision_content_2": "Another part of computer science that interests me is cybersecurity. Thousands of cyber threats are circulating the internet. I am passionate about cybersecurity and want to learn more about it in the future, hopefully developing technology that can prevent cyber threats effectively.",
  "contact": "Contact",
  "journey_begin": "The Jorney Begins...",
  "link_1_title": "Projects",
  "link_1_description": "Explore various projects I've worked on",
  "link_2_title": "Timeline",
  "link_2_description": "Check out the timeline of my journey!"
}