{
  "en": {
    "title": "Style Update",
    "heading_1": "What's new?",
    "color_theme_title": "Color Theme",
    "color_theme_text": "Now the website has dark and light mode! You can switch them on the top of this page. The sun icon is for light mode, giving a bright and clean interface. The moon icon is for dark mode. And the earth icon syncs the website theme with the system's theme.",
    "styling_title": "Website Styling",
    "styling_text_1": "The website is updated to have a different look. The timeline page has an Actual timeline instead of just a list of things I've done in the past. Image on the project page has a increased size to make it feel more modern.",
    "styling_text_2": "This update also gives a better mobile experience through responsive design.",
    "timeline_title": "Timeline",
    "timeline_text": "A horizontal timeline is great for managing versions, so I just decided to add this in",
    "cursor_title": "Cursor",
    "cursor_text": "You can see sometimes the cursor will change, that indicates you can interact with the item you are hovering on. Just a fun feature to add :)",
    "heading_2": "Website Styling",
    "comparison_intro": "Here are some of the comparison between the old and new styling on these different pages.",
    "timeline_page": "Timeline Page",
    "projects_page": "Projects Page",
    "blog_page": "Blog Page"
  },
  "zh": {
    "title": "樣式更新",
    "heading_1": "有什麼新變化？",
    "color_theme_title": "主題顏色",
    "color_theme_text": "現在網站支援深色與淺色模式！你可以在頁面頂部切換。太陽圖示代表淺色模式，提供明亮清晰的介面；月亮圖示為深色模式；地球圖示會根據系統設定自動切換主題。",
    "styling_title": "網站樣式",
    "styling_text_1": "網站的外觀有了全新改版。時間軸頁面現在有實際的時間軸，不再只是過去事件的清單。專案頁的圖片變得更大，整體風格更現代。",
    "styling_text_2": "這次更新也改善了行動裝置上的使用體驗，提供更好的響應式設計。",
    "timeline_title": "時間軸",
    "timeline_text": "橫向時間軸對於版本管理非常實用，所以我決定加入這個功能。",
    "cursor_title": "游標",
    "cursor_text": "你會發現游標有時候會變化，表示你正在滑過可以互動的項目。這只是我加入的一個小趣味功能 :)",
    "heading_2": "網站樣式",
    "comparison_intro": "以下是各個頁面新舊樣式的比較。",
    "timeline_page": "時間軸頁面",
    "projects_page": "專案頁面",
    "blog_page": "部落格頁面"
  },
  "de": {
    "title": "Style-Update",
    "heading_1": "Was ist neu?",
    "color_theme_title": "Farbschema",
    "color_theme_text": "Die Website unterstützt jetzt Hell- und Dunkelmodus! Du kannst sie oben auf der Seite umschalten. Das Sonnensymbol steht für den hellen Modus mit einem sauberen, klaren Design. Der Mond steht für den Dunkelmodus. Und das Erdsymbol synchronisiert das Design mit deinem System.",
    "styling_title": "Website-Styling",
    "styling_text_1": "Die Website hat ein neues Aussehen erhalten. Die Zeitachsen-Seite enthält jetzt eine echte Zeitleiste anstelle einer einfachen Liste. Die Bilder auf der Projektseite wurden vergrößert, um moderner zu wirken.",
    "styling_text_2": "Dieses Update verbessert auch die mobile Benutzererfahrung durch ein responsives Design.",
    "timeline_title": "Zeitachse",
    "timeline_text": "Eine horizontale Zeitachse ist perfekt für die Versionsverwaltung – also habe ich sie eingebaut.",
    "cursor_title": "Cursor",
    "cursor_text": "Der Cursor ändert sich gelegentlich – das zeigt an, dass du mit dem Element interagieren kannst. Nur ein kleines Extra als Spielerei :)",
    "heading_2": "Website-Styling",
    "comparison_intro": "Hier sind einige Vergleiche zwischen dem alten und neuen Design der verschiedenen Seiten.",
    "timeline_page": "Zeitachsen-Seite",
    "projects_page": "Projekt-Seite",
    "blog_page": "Blog-Seite"
  },
  "ja": {
    "title": "スタイルアップデート",
    "heading_1": "新しい機能は？",
    "color_theme_title": "カラーテーマ",
    "color_theme_text": "ウェブサイトにダークモードとライトモードが追加されました！ページの上部で切り替えができます。太陽のアイコンはライトモードで、明るく清潔なインターフェースを提供します。月のアイコンはダークモード用です。地球のアイコンはシステムのテーマに同期します。",
    "styling_title": "ウェブサイトのスタイリング",
    "styling_text_1": "ウェブサイトの見た目を一新しました。タイムラインページは単なるリストではなく、実際のタイムラインを表示します。プロジェクトページの画像は大きくなり、よりモダンな印象になりました。",
    "styling_text_2": "このアップデートはレスポンシブデザインによってモバイル体験も向上させています。",
    "timeline_title": "タイムライン",
    "timeline_text": "バージョン管理には横向きのタイムラインが最適だと思い、追加しました。",
    "cursor_title": "カーソル",
    "cursor_text": "カーソルが時々変わるのが見えると思いますが、それはホバーしているアイテムと対話可能であることを示しています。ちょっとした遊び心です :)",
    "heading_2": "ウェブサイトのスタイリング",
    "comparison_intro": "ここでは、これらのページにおける旧スタイルと新スタイルの比較を示します。",
    "timeline_page": "タイムラインページ",
    "projects_page": "プロジェクトページ",
    "blog_page": "ブログページ"
  },
  "es": {
    "title": "Actualización de Estilo",
    "heading_1": "¿Qué hay de nuevo?",
    "color_theme_title": "Tema de Color",
    "color_theme_text": "¡Ahora el sitio web tiene modo oscuro y claro! Puedes cambiarlo en la parte superior de esta página. El ícono del sol es para el modo claro, que ofrece una interfaz brillante y limpia. El ícono de la luna es para el modo oscuro. Y el ícono de la tierra sincroniza el tema del sitio con el tema del sistema.",
    "styling_title": "Estilo del Sitio Web",
    "styling_text_1": "El sitio web se actualizó para tener un aspecto diferente. La página de la línea de tiempo tiene una línea de tiempo real en lugar de solo una lista de cosas que he hecho en el pasado. La imagen en la página de proyectos ha aumentado de tamaño para hacerla más moderna.",
    "styling_text_2": "Esta actualización también mejora la experiencia móvil mediante un diseño responsivo.",
    "timeline_title": "Línea de Tiempo",
    "timeline_text": "Una línea de tiempo horizontal es ideal para gestionar versiones, así que decidí añadirla.",
    "cursor_title": "Cursor",
    "cursor_text": "A veces verás que el cursor cambia, eso indica que puedes interactuar con el elemento sobre el que estás pasando el ratón. Es solo una característica divertida para agregar :)",
    "heading_2": "Estilo del Sitio Web",
    "comparison_intro": "Aquí hay algunas comparaciones entre el estilo antiguo y el nuevo en estas diferentes páginas.",
    "timeline_page": "Página de Línea de Tiempo",
    "projects_page": "Página de Proyectos",
    "blog_page": "Página de Blog"
  },
  "ko": {
    "title": "스타일 업데이트",
    "heading_1": "무엇이 새로워졌나요?",
    "color_theme_title": "컬러 테마",
    "color_theme_text": "이제 웹사이트에 다크 모드와 라이트 모드가 생겼습니다! 이 페이지 상단에서 전환할 수 있습니다. 태양 아이콘은 라이트 모드로 밝고 깨끗한 인터페이스를 제공합니다. 달 아이콘은 다크 모드용입니다. 지구 아이콘은 시스템 테마와 웹사이트 테마를 동기화합니다.",
    "styling_title": "웹사이트 스타일링",
    "styling_text_1": "웹사이트가 새로운 모습으로 업데이트되었습니다. 타임라인 페이지에는 단순한 과거 목록 대신 실제 타임라인이 추가되었습니다. 프로젝트 페이지의 이미지 크기가 커져서 더 현대적인 느낌을 줍니다.",
    "styling_text_2": "이번 업데이트는 반응형 디자인을 통해 모바일 환경도 개선했습니다.",
    "timeline_title": "타임라인",
    "timeline_text": "수평 타임라인은 버전 관리를 하기 좋기 때문에 추가했습니다.",
    "cursor_title": "커서",
    "cursor_text": "가끔 커서가 바뀌는 것을 볼 수 있는데, 이는 마우스를 올린 항목과 상호작용할 수 있다는 표시입니다. 그냥 재미로 넣은 기능이에요 :)",
    "heading_2": "웹사이트 스타일링",
    "comparison_intro": "아래는 여러 페이지에서의 기존 스타일과 새로운 스타일의 비교입니다.",
    "timeline_page": "타임라인 페이지",
    "projects_page": "프로젝트 페이지",
    "blog_page": "블로그 페이지"
  }
}